Documents/ПолучениеОтПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПолучениеОтПодрядчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИзделияУПодрядчикаПлан</xr:Item>
				<xr:Item>AccumulationRegister.ИзделияУПодрядчика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ИзделияУПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ИзделияУПодрядчика</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПолучениеОтПодрядчика/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ИзделияУПодрядчикаНаСервере(Подрядчик,мИзделмяВ_ТЧ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияУПодрядчикаОстатки.ИзделиеЭлемент КАК ИзделиеЭлемент
		|ИЗ
		|	РегистрНакопления.ИзделияУПодрядчика.Остатки(
		|			,
		|			Подрядчик = &Подрядчик
		|				И НЕ ИзделиеЭлемент В (&мИзделмяВ_ТЧ)) КАК ИзделияУПодрядчикаОстатки
		|ГДЕ
		|	ИзделияУПодрядчикаОстатки.КоличествоОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияУПодрядчикаОстатки.ИзделиеЭлемент.Наименование";
	
	Запрос.УстановитьПараметр("мИзделмяВ_ТЧ", мИзделмяВ_ТЧ);
	Запрос.УстановитьПараметр("Подрядчик", Подрядчик);
	      
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИзделиеЭлемент");
	
КонецФункции

&НаКлиенте
Процедура ИзделияУПодрядчика(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Подрядчик) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен подрядчик";
		Сообщение.Поле = "Объект.Подрядчик";
		Сообщение.Сообщить();
		
	    Возврат;
	КонецЕсли;
	
	мИзделмяВ_ТЧ = Новый Массив;
	Для каждого текИзделие Из Объект.ИзделияЭлемент Цикл
		мИзделмяВ_ТЧ.Добавить(текИзделие.ИзделиеЭлемент);
	КонецЦикла;

	тзНовыеИзделия = ИзделияУПодрядчикаНаСервере(Объект.Подрядчик,мИзделмяВ_ТЧ);
	Для каждого текИзделие Из тзНовыеИзделия Цикл
	    НС = Объект.ИзделияЭлемент.Добавить();
		НС.ИзделиеЭлемент = текИзделие; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры
